Project/Toir/src/Documents/торо_УстановкаПроизвольногоЗначенияНаработки/торо_УстановкаПроизвольногоЗначенияНаработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УстановкаПроизвольногоЗначенияНаработки</name>
  <registerRecords>AccumulationRegister.торо_НаработкаОбъектовРемонта</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыНаработкиОР</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_УчетНаработкиОборудования</types>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаработкаОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксированнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаДоОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АбсолютнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПослеОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзмененияНаработки</name>
      <type>
        <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РаспространятьНаПодчиненных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейНаработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаработкаПодчиненныхОбъектов</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПараметрыВыработкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремяОперации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗафиксированнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаДоОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АбсолютнаяНаработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаработкаПослеОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзмененияНаработки</name>
      <type>
        <types>CatalogRef.торо_ПричиныИзмененияНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <comment>Предназначен для определения иерархии для структуры которой будет распространятся наработка.</comment>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейНаработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/AccumulationRegisters/торо_НаработкаОбъектовРемонта/торо_НаработкаОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_НаработкаОбъектовРемонта</name>
  <resources>
    <name>Наработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/торо_ПериодыНаработкиОР/торо_ПериодыНаработкиОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПериодыНаработкиОР</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_УстановкаПроизвольногоЗначенияНаработки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьЦельностьНаработкиПриОтменеПроведения(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Строка Из НаработкаОбъектов Цикл
		Если ЗначениеЗаполнено(Строка.ДатаИВремяОперации) И Строка.ДатаПоследнейНаработки > Строка.ДатаИВремяОперации Тогда
			ШаблонСообщения = НСтр("es='La línea %1: el Significado ""la Fecha y el tiempo de la operación"" debe ser más que ""la Fecha de la última elaboración""';ru='Строка %1: Значение ""Дата и время операции"" должно быть больше чем ""Дата последней наработки""';en='Line%1: The value of ""Date and time of operation"" must be greater than ""Date of last operating time""'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЦельностьНаработкиПриПроведении(Отказ);
	
	Если Не Отказ Тогда
		
		Для Каждого ТекСтрокаНаработкаОбъектов Из НаработкаОбъектов Цикл
			
			Если ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации<>ТекСтрокаНаработкаОбъектов.ДатаПоследнейНаработки Тогда
				ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
				ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеПриход.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
				ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
				ДвижениеПриход.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
				ДвижениеПриход.Наработка = ТекСтрокаНаработкаОбъектов.Наработка;
				ДвижениеПриход.ДатаКон = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
				ДвижениеПриход.ДатаНач = ТекСтрокаНаработкаОбъектов.ДатаПоследнейНаработки;
				
				Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
				Движение.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
				Движение.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
				Движение.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
			КонецЕсли;
			
			ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
			ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеПриход.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
			ДвижениеПриход.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
			ДвижениеПриход.Наработка = ТекСтрокаНаработкаОбъектов.НаработкаДоОперации - ТекСтрокаНаработкаОбъектов.НаработкаПослеОперации;
			ДвижениеПриход.ДатаКон = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ДатаНач = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;			
			
		КонецЦикла;
		
		Для Каждого ТекСтрокаНаработкаОбъектов Из НаработкаПодчиненныхОбъектов Цикл
			
			ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
			ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеПриход.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
			ДвижениеПриход.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
			ДвижениеПриход.Наработка = ТекСтрокаНаработкаОбъектов.Наработка;
			ДвижениеПриход.ДатаКон = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ДатаНач = ТекСтрокаНаработкаОбъектов.ДатаПоследнейНаработки;
			
			Движение = Движения.торо_ПериодыНаработкиОР.Добавить();
			Движение.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			Движение.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
			Движение.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
			
			ДвижениеПриход = Движения.торо_НаработкаОбъектовРемонта.Добавить();
			ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеПриход.Период = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ОбъектРемонта = ТекСтрокаНаработкаОбъектов.ОбъектРемонта;
			ДвижениеПриход.Показатель = ТекСтрокаНаработкаОбъектов.Показатель;
			ДвижениеПриход.Наработка = ТекСтрокаНаработкаОбъектов.НаработкаДоОперации - ТекСтрокаНаработкаОбъектов.НаработкаПослеОперации;
			ДвижениеПриход.ДатаКон = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
			ДвижениеПриход.ДатаНач = ТекСтрокаНаработкаОбъектов.ДатаИВремяОперации;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Для Каждого Строка Из НаработкаОбъектов Цикл
		АктуализироватьДанныеСтрокиНаработки(Строка);
	КонецЦикла;
	
	Для Каждого Строка Из НаработкаПодчиненныхОбъектов Цикл
		АктуализироватьДанныеСтрокиНаработки(Строка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУправляемыеБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_НаработкаОбъектовРемонта");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = НаработкаОбъектов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","ОбъектРемонта");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.торо_НаработкаОбъектовРемонта");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = НаработкаПодчиненныхОбъектов;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектРемонта","ОбъектРемонта");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Показатель","Показатель");
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура АктуализироватьДанныеСтрокиНаработки(Строка)

	СтруктураВозврата = торо_РаботаСНаработкой.ПолучитьТекущееЗначениеНаработки(Строка.ОбъектРемонта, Строка.Показатель, Ссылка);
	
	Строка.ДатаИВремяОперации = ТекущаяДата();
	Строка.ЗафиксированнаяНаработка = СтруктураВозврата.НаработаноЗначение;
	Строка.ДатаПоследнейНаработки = СтруктураВозврата.НаработаноДата;
	Строка.НаработкаДоОперации = Строка.ЗафиксированнаяНаработка + Строка.Наработка; 
	Строка.АбсолютнаяНаработка = торо_РаботаСНаработкой.АбсолютноеЗначениеНаработки(Ссылка, Строка.ОбъектРемонта, Строка.Показатель);	

КонецПроцедуры

Процедура ПроверитьЦельностьНаработкиПриПроведении(Отказ)
		
	// Проверка, что при вводе данного документа не получится интервала с "незаполненным" значением наработки.
	// При вводе на основании документа "Учет наработки" (происходит при превышении максимального значения) сброс счетчика не требуется.
	Если НЕ Проведен И НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
		
		УстановитьУправляемыеБлокировки();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаработкаОбъектов.ОбъектРемонта КАК Объект,
		|	НаработкаОбъектов.Показатель КАК Показатель,
		|	НаработкаОбъектов.ДатаПоследнейНаработки КАК ДатаРаботыС
		|ПОМЕСТИТЬ НаработкаОбъектов
		|ИЗ
		|	&НаработкаОбъектов КАК НаработкаОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаработкаПодчиненныхОбъектов.ОбъектРемонта КАК Объект,
		|	НаработкаПодчиненныхОбъектов.Показатель КАК Показатель,
		|	НаработкаПодчиненныхОбъектов.ДатаПоследнейНаработки КАК ДатаРаботыС
		|ПОМЕСТИТЬ НаработкаПодчиненныхОбъектов
		|ИЗ
		|	&НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(НаработкаОбъектов.Объект КАК Справочник.торо_ОбъектыРемонта) КАК Объект,
		|	НаработкаОбъектов.Показатель КАК Показатель,
		|	НаработкаОбъектов.ДатаРаботыС КАК ДатаРаботыС
		|ПОМЕСТИТЬ торо_УчетНаработкиОборудованияНаработкаОбъектов
		|ИЗ
		|	НаработкаОбъектов КАК НаработкаОбъектов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(НаработкаПодчиненныхОбъектов.Объект КАК Справочник.торо_ОбъектыРемонта),
		|	НаработкаПодчиненныхОбъектов.Показатель,
		|	НаработкаПодчиненныхОбъектов.ДатаРаботыС
		|ИЗ
		|	НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Объект,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПериодыНаработкиОРСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ПериодыНаработкиОРСрезПоследних.Показатель КАК Показатель,
		|	торо_ПериодыНаработкиОРСрезПоследних.Период КАК ДатаКон
		|ПОМЕСТИТЬ ВТ_Даты
		|ИЗ
		|	РегистрСведений.торо_ПериодыНаработкиОР.СрезПоследних(
		|			,
		|			(ОбъектРемонта, Показатель) В
		|					(ВЫБРАТЬ
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель
		|					ИЗ
		|						торо_УчетНаработкиОборудованияНаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов)
		|				И Регистратор <> &Ссылка) КАК торо_ПериодыНаработкиОРСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектРемонта,
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект КАК Объект,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыС КАК ДатаРаботыС,
		|	ЕСТЬNULL(ВТ_Даты.ДатаКон, торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект.ДатаВводаВЭксплуатацию) КАК ДатаКон
		|ИЗ
		|	торо_УчетНаработкиОборудованияНаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Даты КАК ВТ_Даты
		|		ПО торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект = ВТ_Даты.ОбъектРемонта
		|			И торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель = ВТ_Даты.Показатель
		|ГДЕ
		|	ЕСТЬNULL(ВТ_Даты.ДатаКон, торо_УчетНаработкиОборудованияНаработкаОбъектов.Объект.ДатаВводаВЭксплуатацию) <> торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаРаботыС";
		
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("НаработкаОбъектов", НаработкаОбъектов);
		Запрос.УстановитьПараметр("НаработкаПодчиненныхОбъектов", НаработкаПодчиненныхОбъектов);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			ВыборкаНаработокСОшибками = РезультатЗапроса.Выбрать();
			Пока ВыборкаНаработокСОшибками.Следующий() Цикл
				Если ВыборкаНаработокСОшибками.ДатаКон = ВыборкаНаработокСОшибками.Объект.ДатаВводаВЭксплуатацию Тогда 
					ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" no es fijados el significado de la elaboración ""%2"", la fecha de la introducción del objeto en la explotación: ¡%3,"
" el campo ""la Fecha del trabajo con"" en el documento es rellenado incorrectamente! Comprueben la corrección del relleno del campo dado de la parte tabular del documento.';ru='Для объекта ремонта ""%1"" не зафиксировано значение наработки ""%2"", дата ввода объекта в эксплуатацию: %3,"
"  поле ""Дата работы с"" в документе заполнено неверно! Проверьте корректность заполнения данного поля табличной части документа.';en='The operating time"" ""%2"" ""for the repair object"" ""%1"" ""is not fixed, the date of commissioning of the object:%3,"
"   the field """" Date of work with """" in the document is filled incorrectly! Check the correctness of filling in this field of the tabular part of the document. '");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
				Иначе
					ШаблонСообшения = НСтр("es='¡Para el objeto de la reparación ""%1"" es fijado el significado de la elaboración ""%2"", en %3,"
" el campo ""la Fecha del trabajo con"" en el documento es rellenado incorrectamente! Comprueben la corrección del relleno del campo dado de la parte tabular del documento.';ru='Для объекта ремонта ""%1"" зафиксировано значение наработки ""%2"", на %3,"
"  поле ""Дата работы с"" в документе заполнено неверно! Проверьте корректность заполнения данного поля табличной части документа.';en='For the repair object"" ""%1"" ""the value of the operating time"" ""%2"" "",%3,"
"   the field """" Date of work with """" in the document is filled incorrectly! Check the correctness of filling in this field of the tabular part of the document.'");
					ТекстСообщения = СтрШаблон(ШаблонСообшения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
				КонецЕсли;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЦельностьНаработкиПриОтменеПроведения(Отказ)
	
	// Проверка, что при вводе данного документа не получится интервала с "незаполненным" значением наработки.
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ОбъектРемонта КАК Объект,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.Показатель КАК Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаОбъектов.ДатаИВремяОперации КАК ДатаРаботыПо
	|ПОМЕСТИТЬ НаработкаОбъектов
	|ИЗ
	|	&НаработкаОбъектов КАК торо_УчетНаработкиОборудованияНаработкаОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.ОбъектРемонта КАК Объект,
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.Показатель КАК Показатель,
	|	торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов.ДатаИВремяОперации КАК ДатаРаботыПо
	|ПОМЕСТИТЬ НаработкаПодчиненныхОбъектов
	|ИЗ
	|	&НаработкаПодчиненныхОбъектов КАК торо_УчетНаработкиОборудованияНаработкаПодчиненныхОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаработкаОбъектов.Объект КАК Объект,
	|	НаработкаОбъектов.Показатель КАК Показатель,
	|	НаработкаОбъектов.ДатаРаботыПо КАК ДатаРаботыПо
	|ПОМЕСТИТЬ торо_УчетНаработкиОборудованияНаработкаОбъектов
	|ИЗ
	|	НаработкаОбъектов КАК НаработкаОбъектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НаработкаПодчиненныхОбъектов.Объект,
	|	НаработкаПодчиненныхОбъектов.Показатель,
	|	НаработкаПодчиненныхОбъектов.ДатаРаботыПо
	|ИЗ
	|	НаработкаПодчиненныхОбъектов КАК НаработкаПодчиненныхОбъектов";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаработкаОбъектов", НаработкаОбъектов);
	Запрос.УстановитьПараметр("НаработкаПодчиненныхОбъектов", НаработкаПодчиненныхОбъектов);
	Запрос.Выполнить();
	
	РезультатЗапроса = торо_РаботаСНаработкой.ПолучитьОбъектыРемонтаСНаработкойВБудущем(МВТ, Ссылка);
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаНаработокСОшибками = РезультатЗапроса.Выбрать();
		Пока ВыборкаНаработокСОшибками.Следующий() Цикл
			ШаблонСообщения = НСтр("es='Para el objeto de la reparación ""%1"" es fijado el significado de la elaboración ""%2"" a una fecha más avanzada, que el documento: por %3. "
"¡La anulación de la realización del documento es imposible! Para la ejecución de las acciones con el documento anulen la realización de unos documentos más avanzados.';ru='Для объекта ремонта ""%1"" зафиксировано значение наработки ""%2"" на более позднюю дату, чем документом: по %3. "
"Отмена проведения документа невозможна! Для выполнения действий с документом отмените проведение более поздних документов.';en='For the repair object"" ""%1"" ""the value of the operating time"" ""%2"" ""was fixed at a later date than the document:%3 each."
"Canceling a document is not possible! To perform actions with the document, cancel the holding of later documents.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ВыборкаНаработокСОшибками.Объект, ВыборкаНаработокСОшибками.Показатель, ВыборкаНаработокСОшибками.ДатаКон);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
